{
  "2025-05-02": "Reminder: Submit your Q2 OKRs by May 5 via the HR portal.",
  "2025-05-03": "Leadership workshop scheduled for May 10. RSVP by May 7.",
  "2025-05-04": "Our new cafeteria vendor starts today. Check out the revised menu!",
  "2025-05-05": "Security Awareness Month begins. Participate in weekly quizzes to win prizes.",
  "2025-05-06": "Tech Talk Thursday resumes on May 9. Topic: AI in Customer Support.",
  "2025-05-07": "New learning modules on time management and agile practices now live on LMS.",
  "2025-05-08": "Internal job postings for Product and Engineering teams are now open.",
  "2025-05-09": "Deadline for performance review self-assessments is May 15.",
  "2025-05-10": "Office library has been restocked with new titles—check it out on Floor 3.",
  "2025-05-11": "Team lunch sponsored by HR this Friday—vegetarian options available.",
  "2025-05-12": "Finance team townhall scheduled for May 16 at 4 PM.",
  "2025-05-13": "Monthly cybersecurity drill happening this Thursday—stay alert.",
  "2025-05-14": "Client success stories now featured in the intranet’s new spotlight section.",
  "2025-05-16": "Join the volunteering drive for World Environment Day—sign-up open.",
  "2025-05-17": "Facilities upgrade completed on Floors 1 and 2. Workstations refreshed.",
  "2025-05-18": "Company intranet has a fresh look—explore the new design and features.",
  "2025-05-19": "Last day to nominate a peer for the Q2 Appreciation Awards.",
  "2025-05-21": "Fire safety drills scheduled between May 27–30. Participation is mandatory.",
  "2025-05-22": "New partnership with SkillWise: All employees get free premium access.",
  "2025-05-23": "Monthly newsletter is live! Highlights include project launches and milestones.",
  "2025-05-24": "HR policy on remote work has been updated—review in HR portal.",
  "2025-05-26": "Wellness Wednesday: Join the meditation session at 3 PM in Room A201.",
  "2025-05-27": "Sales team exceeded targets for Q1—kudos to all involved!",
  "2025-05-29": "Friendly reminder: Submit reimbursement claims by May 31.",
  "2025-05-30": "New hire orientation program for June cohort scheduled on June 3.",
  "2025-05-31": "Last day to update your emergency contact details in your employee profile.",
  "2025-06-01": "June Learning Challenge begins today—complete modules to earn badges.",
  "2025-06-02": "Pride Month celebrations kick off—check intranet for upcoming events.",
  "2025-06-03": "Internal mentorship program applications open—deadline June 10.",
  "2025-06-04": "Quarterly hackathon announced for June 15–16. Registration now open.",
  "2025-06-06": "Company celebrates 5 years in the new HQ—celebration event on June 12.",
  "2025-06-07": "Pet-friendly Friday introduced—guidelines available on the HR page.",
  "2025-06-08": "Technical certifications added to learning reimbursement list.",
  "2025-06-09": "Don’t miss the CEO's AMA session on June 11 at 3 PM.",
  "2025-06-10": "Biometric attendance upgrade rolling out June 17. Training to follow.",
  "2025-06-11": "Global Diversity Day webinar hosted by HR—register on LMS.",
  "2025-06-12": "Departmental budgeting tool goes live June 13—training links shared.",
  "2025-06-13": "Customer Experience Awards nominations close June 18.",
  "2025-06-14": "Office plant-a-tree day scheduled for June 19—volunteers needed.",
  "2025-06-15": "Celebrating our newest patent approval by the R&D team!",
  "2025-06-16": "June birthdays celebration at 5 PM in the atrium—cake included!",
  "2025-06-17": "Final call: Book your seat for the company retreat by June 18.",
  "2025-06-18": "Security patch scheduled for June 21 at midnight—log off by 11:45 PM.",
  "2025-06-19": "EAP (Employee Assistance Program) now offers 24/7 counseling services.",
  "2025-06-20": "Quarterly Town Hall begins today at 10 AM. Join via Zoom link in calendar.",
  "2025-06-21": "Kudos to the Legal Team for closing a major partnership deal!",
  "2025-06-22": "New ergonomic chairs to be delivered to all teams this week.",
  "2025-06-23": "Tech support tickets now centralized through the new Service Desk Portal.",
  "2025-06-24": "Weekly open-mic Friday starts June 28—showcase your talents!"
}

